---
kind: property
id: P:Autodesk.Revit.DB.ConicalSurface.YDir
source: html/04a0fdd6-3ee4-df1f-c571-5e81550c65cf.htm
---
# Autodesk.Revit.DB.ConicalSurface.YDir Property

X axis of the local coordinate system associated with this cone.

## Syntax (C#)
```csharp
public XYZ YDir { get; }
```